## Pandas 연습문제

### Titanic - sns.load_dataset('titanic')

a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨
1)20살이 넘으면 성별을 그대로 사용한다.
2)20살 미만이면 성별에 관계없이 “child”라고 한다.

b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

d.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고,
각 그룹별 생존율을 구하시오.
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

e.qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [40]:
titanic = sns.load_dataset('titanic')
titanic = titanic[['survived', 'age', 'sex']]

In [ ]:
# 답
titanic = sns.load_dataset('titanic')
titanic = titanic[['survived','sex','age','class','embark_town']]
titanic.tail()

- a

In [41]:
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else "child", axis = 1)
titanic.tail()

     survived   age     sex category1
886         0  27.0    male      male
887         1  19.0  female     child
888         0   NaN  female     child
889         1  26.0    male      male
890         0  32.0    male      male

- b

In [42]:
titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean(),0))
titanic.tail()

     survived   age     sex category1
886         0  27.0    male      male
887         1  19.0  female     child
888         0  30.0  female     child
889         1  26.0    male      male
890         0  32.0    male      male

In [ ]:
# b 답
titanic['age'] = titanic.age.fillna(titanic.age.mean()).astype(int)
# titanic['age'] = titanic.age.astype(int)
titanic.tail()

In [ ]:
# a를 다시 계산 / 그럼 결과가 바뀌어있음
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else "child", axis = 1)
titanic.tail()

- c

In [ ]:
titanic['sex']

In [ ]:
# c 답 - 방법1 - pivot table

titanic.pivot_table('survived', 'sex')

In [ ]:
# 방법 2 - groupby

titanic[['sex','survived']].groupby(['sex']).mean()

In [ ]:
titanic.pivot_table('survived', 'class')

In [ ]:
titanic.pivot_table('survived', 'embark_town')

In [ ]:
titanic.pivot_table('survived', ['sex', 'class'])

In [ ]:
pd.crosstab([titanic.sex, titanic.survived], titanic['class'], margins=True)

- d

In [45]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age.values, bins, labels = labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', '청년', '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [53]:
df = pd.DataFrame(cats.value_counts(), columns= ['생존자수'])
df

      생존자수
미성년자   165
청년     407
중년     241
장년      59
노년       5

In [56]:
titanic.survived.mean()      # 생존율 = survived의 평균!!!

0.3838383838383838

In [ ]:
# d 답
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic["age_cat"] = pd.cut(titanic.age, bins, labels=labels)
titanic.tail()

In [ ]:
titanic.pivot_table('survived', 'age_cat')

- e

In [ ]:
# e 답
titanic['age_group'] = pd.qcut(titanic.age, 3, labels = ["A1", "A2", "A3"])
titanic.tail()

In [ ]:
titanic.pivot_table('survived', 'age_group')

In [ ]:
# gender : 남성이면 1, 여성이면 0
titanic['gender'] = titanic.group(lambda r: 1 if r.sex == 'male' else 0, axis = 1)
titanic.tail()

In [ ]:
titanic.pivot_table(['survived','gender'], 'age_group')

In [ ]:
titanic[['age_group','survived','gender']].groupby(['age_group']).mean()

### Mile Per Gallon - sns.load_dataset('mpg')

a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

b.name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

e.모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.

In [57]:
mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [ ]:
mpg.describe()

- a

In [ ]:
# a 답
mpg['hp_per_cc'] = mpg.horsepower / mpg.displacement
mpg.head()

- b

In [ ]:
# b 답
def get_mfcer(full_name):
    return full_name.split()[0]     # 첫번쨰값을 split
def get_mpdel(full_name):
    return ' '.join.(full_name.split()[1:])     # 인덱스1부터 끝까지 split 해서 join

In [ ]:
get_mfcer('ford torino'), get_model('ford torino')  # 제대로 나오는지 확인

In [ ]:
get_mfcer('chrysler lebaron medallion'), get_model('chrysler lebaron medallion')

In [ ]:
mpg['manufacturer'] = mpg.name.apply(get_mfcer)
mpg['model'] = mpg.name.apply(get_model)
del mpg['name']
mpg.head()

- c

In [ ]:
# c 답
mpg[['cylinders','mpg']].groupby('cylinders').mean()

In [ ]:
# pivot table 사용
mpg.pivot_table('mpg','cylinders')

- d

In [ ]:
# d 답
mpg[['origin','hp_per_cc']].groupby('origin').mean()

- e

In [ ]:
# e 답
mpg.manufacturer.value_counts()

In [ ]:
s = mpg.manufacturer.value_counts()
big = s[s >= 5].index.tolist()
print(big)  # big = 모델이 5개 이상인 자동차 회사들

In [ ]:
# in 연산자 대신에 isin() method 사용
mpg[mpg.manufacturer.isin(big)].head()  # 모델이 5개이상인 회사들 필터링결과

In [ ]:
big_mpg = mpg[mpg.manufacturer.isin(big)]
big_mpg[['manufacturer','mpg']].groupby('manufacturer').mean()

In [ ]:
big_mpg.pivot_table('mpg','manufacturer')

In [ ]:
big_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg',ascending=False)[:5]

In [ ]:
# filter 사용해서 하기

new_mpg = mpg.groupby('manufacturer').filter(lambda x: x.manufacturer.count() >= 5)
new_mpg.head()      # big_mpg랑 같은 결과 나옴

In [ ]:
new_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg',ascending=False)[:5]

In [ ]:
# 데이터테이블에서 끄집어내는 방법들
Selection   COLUMNS FROM    TABLE
            WHERE
            ORDER BY
            LIMIT
            GROUP BY
            HAVING
            JOIN